jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16F753.PIC
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="COG1CON0" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="COG1CON0" edc:nzwidth="8" edc:por="000000-0" edc:_addr="0x198">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1MD" edc:desc="" edc:mask="0x1" edc:name="G1MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1LD" edc:desc="" edc:mask="0x1" edc:name="G1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POL0" edc:desc="" edc:mask="0x1" edc:name="G1POL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POL1" edc:desc="" edc:mask="0x1" edc:name="G1POL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OE0" edc:desc="" edc:mask="0x1" edc:name="G1OE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OE1" edc:desc="" edc:mask="0x1" edc:name="G1OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="COG1CON1" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="COG1CON1" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x199">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x3" edc:name="G1CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="G1FDBTS" edc:desc="" edc:mask="0x1" edc:name="G1FDBTS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RDBTS" edc:desc="" edc:mask="0x1" edc:name="G1RDBTS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS1" edc:desc="" edc:mask="0x1" edc:name="G1CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="COG1RIS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="COG1RIS" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x19A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1RIC1" edc:desc="" edc:mask="0x1" edc:name="G1RIC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIC2" edc:desc="" edc:mask="0x1" edc:name="G1RIC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1RICCP1" edc:desc="" edc:mask="0x1" edc:name="C1RICCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIFLT" edc:desc="" edc:mask="0x1" edc:name="G1RIFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIT2M" edc:desc="" edc:mask="0x1" edc:name="G1RIT2M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1R1HLT1" edc:desc="" edc:mask="0x1" edc:name="G1R1HLT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIHLT2" edc:desc="" edc:mask="0x1" edc:name="G1RIHLT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="COG1RSIM" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="COG1RSIM" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x19B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1RMC1" edc:desc="" edc:mask="0x1" edc:name="G1RMC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RMC2" edc:desc="" edc:mask="0x1" edc:name="G1RMC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RMCCP1" edc:desc="" edc:mask="0x1" edc:name="G1RMCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RMFLT" edc:desc="" edc:mask="0x1" edc:name="G1RMFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RTM2M" edc:desc="" edc:mask="0x1" edc:name="G1RTM2M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RMHLT1" edc:desc="" edc:mask="0x1" edc:name="G1RMHLT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RMHLT2" edc:desc="" edc:mask="0x1" edc:name="G1RMHLT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="COG1FIS" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="COG1FIS" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x19C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1FIC1" edc:desc="" edc:mask="0x1" edc:name="G1FIC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIC2" edc:desc="" edc:mask="0x1" edc:name="G1FIC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FICCP1" edc:desc="" edc:mask="0x1" edc:name="G1FICCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIFLT" edc:desc="" edc:mask="0x1" edc:name="G1FIFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIT2M" edc:desc="" edc:mask="0x1" edc:name="G1FIT2M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIHLT1" edc:desc="" edc:mask="0x1" edc:name="G1FIHLT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FIHLT2" edc:desc="" edc:mask="0x1" edc:name="G1FIHLT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
