jFoster426/jFoster426.github.io/Projects/DIYPACEISB/PACE ISB Cubby/Microchip.PIC16Fxxx_DFP.1.7.162/edc/PIC16F753.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="COG1FSIM" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="COG1FSIM" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x19D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1FMC1" edc:desc="" edc:mask="0x1" edc:name="G1FMC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMC2" edc:desc="" edc:mask="0x1" edc:name="G1FMC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMCCP1" edc:desc="" edc:mask="0x1" edc:name="G1FMCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMFLT" edc:desc="" edc:mask="0x1" edc:name="G1FMFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMT2M" edc:desc="" edc:mask="0x1" edc:name="G1FMT2M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMHLT1" edc:desc="" edc:mask="0x1" edc:name="G1FMHLT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1FMHLT2" edc:desc="" edc:mask="0x1" edc:name="G1FMHLT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="COG1ASD0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="COG1ASD0" edc:nzwidth="8" edc:por="000000--" edc:_addr="0x19E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASD0L" edc:desc="" edc:mask="0x3" edc:name="G1ASD0L" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ASD1L" edc:desc="" edc:mask="0x3" edc:name="G1ASD1L" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ARSEN" edc:desc="" edc:mask="0x1" edc:name="G1ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDE" edc:desc="" edc:mask="0x1" edc:name="G1ASDE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1ASD0L0" edc:desc="" edc:mask="0x1" edc:name="G1ASD0L0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASD0L1" edc:desc="" edc:mask="0x1" edc:name="G1ASD0L1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASD1L0" edc:desc="" edc:mask="0x1" edc:name="G1ASD1L0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASD1L1" edc:desc="" edc:mask="0x1" edc:name="G1ASD1L1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="COG1ASD1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="COG1ASD1" edc:nzwidth="8" edc:por="---00000" edc:_addr="0x19F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1ASDSFLT" edc:desc="" edc:mask="0x1" edc:name="G1ASDSFLT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC1" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSC2" edc:desc="" edc:mask="0x1" edc:name="G1ASDSC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSHLT1" edc:desc="" edc:mask="0x1" edc:name="G1ASDSHLT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDSHLT2" edc:desc="" edc:mask="0x1" edc:name="G1ASDSHLT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobank"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xC0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="gpr3" edc:shadowidref="gprnobank" edc:shadowoffset="0x0"/>
      <edc:EmulatorZone edc:beginaddr="0x19" edc:endaddr="0x1C" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="simple">
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="T1G" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="COG1OUT0"/>
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="COG1OUT1"/>
      <edc:VirtualPin edc:name="C2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="SLPCIN"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OPA1OUT"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="OPA1IN-"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="OPA1IN+"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C2IN0+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="COG1FLT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="C1IN0-"/>
      <edc:VirtualPin edc:name="C2IN0-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="FVRIN"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="C1IN0+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="DACOUT"/>
      <edc:VirtualPin edc:name="FVROUT"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
